src/ex_Tabakon/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УдалитьТабачнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбъемДАЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроизводительИмпортерАлкогольнойПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазовыеЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСерийногоНомера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСерийныхНомеровСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаборУпаковок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидАлкогольнойПродукцииЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыАлкогольнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КиЗГИСМРазмер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РазмерыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РазрешитьВводДробногоКоличества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИспользоватьСерийныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСрокаДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокДействияПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоПериодовДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидМехаГИСМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыМехаГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодВидаНоменклатурнойКлассификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КиЗГИСМВид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКиЗГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КиЗГИСМСпособВыпускаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыпускаВОборотГИСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ex_Tabakon/CommonModules/ШтрихкодированиеИСРТ/Ext/Module.bsl
Процедура ТБКЗаполнитьДанныеПоШтрихкодамEAN(ДанныеПоШтрихкодамEAN, ПарамтерыПоискаРМК, МРЦ = Неопределено) экспорт
	
	ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	ПРЕДСТАВЛЕНИЕ(Номенклатура.Ссылка) КАК ПредставлениеНоменклатуры,
			|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
			|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихкодEAN,
			|	&ОпределениеВидаПродукции КАК ВидПродукции,
			|	&ОпределениеПризнакаМаркируемаяПродукция КАК МаркируемаяПродукция,
			|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
			|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Коэффициент, 1) КАК Количество,
			|	&УсловиеОсобенностьУчета КАК ПродукцияИС
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО ШтрихкодыНоменклатуры.Владелец = Номенклатура.Ссылка
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкоды)";

	
	ИнтеграцияИСРТ.ОпределитьВидПродукцииТекстаЗапроса(ТекстЗапроса, "Номенклатура");
	ИнтеграцияИСРТ.ОпределитьОсобенностиУчетаТекстаЗапроса(ТекстЗапроса, "Номенклатура",, Истина);
	ОпределениеМаркируемаяПродукция = ИнтеграцияИСРТ.ОпределениеПризнакаМаркируемаяПродукцияТекстаЗапроса("Номенклатура");
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОпределениеПризнакаМаркируемаяПродукция", ОпределениеМаркируемаяПродукция);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	//Вик 2024-07-02
	Если МРЦ <> Неопределено тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	ПРЕДСТАВЛЕНИЕ(Номенклатура.Ссылка) КАК ПредставлениеНоменклатуры,
			|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
			|	ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
			|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихкодEAN,
			|	&ОпределениеВидаПродукции КАК ВидПродукции,
			|	&ОпределениеПризнакаМаркируемаяПродукция КАК МаркируемаяПродукция,
			|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
			|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка.Коэффициент, 1) КАК Количество,
			|	&УсловиеОсобенностьУчета КАК ПродукцияИС
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО ШтрихкодыНоменклатуры.Владелец = Номенклатура.Ссылка
			|ГДЕ
			|	ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкоды)
			|	И ШтрихкодыНоменклатуры.Характеристика.Наименование = &Наименование";
		
		ИнтеграцияИСРТ.ОпределитьВидПродукцииТекстаЗапроса(ТекстЗапроса, "Номенклатура");
		ИнтеграцияИСРТ.ОпределитьОсобенностиУчетаТекстаЗапроса(ТекстЗапроса, "Номенклатура",, Истина);
		ОпределениеМаркируемаяПродукция = ИнтеграцияИСРТ.ОпределениеПризнакаМаркируемаяПродукцияТекстаЗапроса("Номенклатура");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОпределениеПризнакаМаркируемаяПродукция", ОпределениеМаркируемаяПродукция);
	
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Наименование", МРЦ);		
	КонецЕсли;   
	
	Запрос.УстановитьПараметр("Штрихкоды", ДанныеПоШтрихкодамEAN.ВыгрузитьКолонку("ШтрихкодEAN"));	
	
	флВозможноЭтоБлок	=	Ложь;
	Если Запрос.Выполнить().Пустой() тогда // дополнительно для блока
		флВозможноЭтоБлок = Истина;
		Запрос.Текст	=	СтрЗаменить(Запрос.Текст, "И ШтрихкодыНоменклатуры.Характеристика.Наименование = &Наименование", "");
	КонецЕсли;
	
	
	ДанныеПоШтрихкодам = Запрос.Выполнить().Выгрузить();   
	
	Если флВозможноЭтоБлок тогда
		Для каждого Строка Из ДанныеПоШтрихкодам цикл
			Запрос	=	Новый Запрос("ВЫБРАТЬ
			      	 	             |	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
			      	 	             |ИЗ
			      	 	             |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
			      	 	             |ГДЕ
			      	 	             |	ХарактеристикиНоменклатуры.Наименование = &Наименование
			      	 	             |	И ХарактеристикиНоменклатуры.Владелец = &Владелец");
			Запрос.УстановитьПараметр("Наименование", МРЦ);	
			Запрос.УстановитьПараметр("Владелец", Строка.Номенклатура);	
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() тогда
				Строка.Характеристика	=	рез.Ссылка;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;
	//
	
	
	ТребуетсяОбработкаШтрихкодаНовымСтрокам = Истина;
	// Заполним таблицу.
	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("ШтрихкодEAN");
	ДанныеПоШтрихкодамРезультат = ДанныеПоШтрихкодамEAN.СкопироватьКолонки(); 
	Для Каждого СтрокаТаблицы Из ДанныеПоШтрихкодамEAN Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТаблицы);
		
		// Определим, требуется ли обработка штрихкода средствами РТ.
		НайденаПродукцияИС = Ложь;
		
		СтрокиШтрихкодов = ДанныеПоШтрихкодам.НайтиСтроки(ПараметрыПоиска);
		Для Каждого СтрокаШтрихкод Из СтрокиШтрихкодов Цикл
			Если СтрокаШтрихкод.ПродукцияИС И СтрокаШтрихкод.МаркируемаяПродукция Тогда
				НайденаПродукцияИС = Истина;
				ТребуетсяОбработкаШтрихкодаНовымСтрокам = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ТребуетсяОбработкаШтрихкода = НЕ НайденаПродукцияИС;
		
		// Добавим найденные штрихкоды в результирующую таблицу.
		Для Каждого СтрокаШтрихкод Из СтрокиШтрихкодов Цикл
			СтрокаРезультат = ДанныеПоШтрихкодамРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаШтрихкод);
			СтрокаРезультат.ТребуетсяОбработкаШтрихкода = ТребуетсяОбработкаШтрихкода;
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ДанныеПоШтрихкодамEAN Цикл
		
		ЗаполнитьЗначенияСвойств(ПараметрыПоиска, СтрокаТаблицы);
		СтрокиШтрихкодов = ДанныеПоШтрихкодам.НайтиСтроки(ПараметрыПоиска);
		
		// Добавим ненайденные штрихкоды, если сканирование выполняется не в форме проверки и подбора.
		Если СтрокиШтрихкодов.Количество() = 0 Тогда
			// Не нашли штрихкод.
			СтрокаРезультат = ДанныеПоШтрихкодамРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРезультат, СтрокаТаблицы);
			СтрокаРезультат.ТребуетсяОбработкаШтрихкода = ТребуетсяОбработкаШтрихкодаНовымСтрокам;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПарамтерыПоискаРМК = Неопределено Тогда
		
		Штрихкод = ПарамтерыПоискаРМК.ШтрихкодОригинальный;
		ЭтоШтрихкодНоменклатуры = Ложь;
		Для Каждого СтрокаДанных Из ДанныеПоШтрихкодамРезультат Цикл
			Если Штрихкод = СтрокаДанных.ШтрихкодEAN Тогда
				ЭтоШтрихкодНоменклатуры = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоШтрихкодНоменклатуры Тогда
			ДанныеПоШтрихкодамРезультат.Очистить();
		КонецЕсли;
		
		Если ПарамтерыПоискаРМК.Свойство("ДанныеРучногоСопоставления") Тогда
			ДанныеРучногоСопоставления = ПарамтерыПоискаРМК.ДанныеРучногоСопоставления;
			ДанныеПоШтрихкодамРезультат.Очистить();
			
			НоваяСтрока = ДанныеПоШтрихкодамРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеРучногоСопоставления, , "Упаковка");
			Если ТипЗнч(ДанныеРучногоСопоставления.Упаковка) = Тип("СправочникСсылка.УпаковкиНоменклатуры") Тогда
				НоваяСтрока.Упаковка = ДанныеРучногоСопоставления.Упаковка;
			КонецЕсли;
			НоваяСтрока.ШтрихкодEAN = ДанныеРучногоСопоставления.Штрихкод;
			НоваяСтрока.ВидПродукции = ИнтеграцияИСРТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(НоваяСтрока.Номенклатура.ОсобенностьУчета);
			НоваяСтрока.Количество = 1;
			НоваяСтрока.МаркируемаяПродукция = Истина;
			НоваяСтрока.ПредставлениеНоменклатуры = НоваяСтрока.Номенклатура;
		КонецЕсли;
		
		НайденаНоменклатура = Ложь;
		Для Каждого СтрокаРезультата Из ДанныеПоШтрихкодамРезультат Цикл
			Если ЗначениеЗаполнено(СтрокаРезультата.Номенклатура) Тогда
				НайденаНоменклатура = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Если НайденаНоменклатура Тогда
			ПарамтерыПоискаРМК.ФильтрПоискаПоШтрихкоду.Вставить("ЗаданнаяТаблицаНоменклатуры", ДанныеПоШтрихкодамРезультат);
		КонецЕсли;
		ДанныеШтрихкодаРМК = Новый Структура;
		РаботаСоШтрихкодамиПереопределяемый.ЗаполнитьДанныеПоискаПоШтрихкоду(Штрихкод, ПарамтерыПоискаРМК, ДанныеШтрихкодаРМК);
		Если НайденаНоменклатура Тогда
			ПарамтерыПоискаРМК.ФильтрПоискаПоШтрихкоду.Удалить("ЗаданнаяТаблицаНоменклатуры");
		КонецЕсли;
		ДанныеШтрихкодаРМК.Вставить("ПараметрыДляОбработкиШтрихкода", ПарамтерыПоискаРМК.ПараметрыДляОбработкиШтрихкода);
		
		Если Не НайденаНоменклатура И Не ЭтоШтрихкодНоменклатуры И ДанныеПоШтрихкодамРезультат.Количество() > 0 Тогда
			Если ДанныеШтрихкодаРМК.ЗначенияПоиска.Количество() > 0 Тогда
				Для Каждого ЗначениеПоиска Из ДанныеШтрихкодаРМК.ЗначенияПоиска Цикл
					Если ЗначениеПоиска.ТипОбъекта = Тип("СправочникСсылка.ШтрихкодыУпаковокТоваров")
						И ЗначениеЗаполнено(ЗначениеПоиска.Владелец.Номенклатура) Тогда
						СтрокаДанных = ДанныеПоШтрихкодамРезультат[0];
						СтрокаДанных.ВидПродукции              =
							ИнтеграцияИСРТКлиентСервер.ОсобенностьУчетаПоВидуПродукции(ЗначениеПоиска.Номенклатура.ОсобенностьУчета);
						СтрокаДанных.МаркируемаяПродукция      = Истина;
						СтрокаДанных.Номенклатура              = ЗначениеПоиска.Номенклатура;
						СтрокаДанных.ПредставлениеНоменклатуры = ЗначениеПоиска.Номенклатура;
						НайденаНоменклатура = Истина;
						ДанныеПоШтрихкодамРезультат.ЗаполнитьЗначения(Ложь, "ТребуетсяОбработкаШтрихкода");
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеПоШтрихкодамРезультат.Количество() = 0 Тогда
			ШтрихкодПоискаДляСопоставления = ?(ЭтоШтрихкодНоменклатуры, Штрихкод, ДанныеШтрихкодаРМК.ПараметрыШтрихкода.ШтрихкодПоиска);
			
			НоваяСтрока = ДанныеПоШтрихкодамРезультат.Добавить();
			НоваяСтрока.ТребуетсяОбработкаШтрихкода = Истина;
			НоваяСтрока.ШтрихкодEAN = ШтрихкодПоискаДляСопоставления;
			НоваяСтрока.ДанныеШтрихкода = ДанныеШтрихкодаРМК;
		Иначе
			Для Каждого СтрокаТовара Из ДанныеПоШтрихкодамРезультат Цикл
				Если Не НайденаНоменклатура Тогда
					СтрокаТовара.ТребуетсяОбработкаШтрихкода = Истина;
				КонецЕсли;
				СтрокаТовара.ДанныеШтрихкода = ДанныеШтрихкодаРМК;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	ИменаКолонок = Новый Массив;
	Для Каждого Колонка Из ДанныеПоШтрихкодамРезультат.Колонки Цикл
		ИменаКолонок.Добавить(Колонка.Имя);
	КонецЦикла;
	ДанныеПоШтрихкодамРезультат.Свернуть(СтрСоединить(ИменаКолонок, ","));
	
	ДанныеПоШтрихкодамEAN = ДанныеПоШтрихкодамРезультат;

КонецПроцедуры

//&Вместо("ЗаполнитьДанныеПоШтрихкодамEAN")
//Процедура ТБКЗаполнитьДанныеПоШтрихкодамEAN(ДанныеПоШтрихкодамEAN)

//	ШтрихкодыEAN = ДанныеПоШтрихкодамEAN.ВыгрузитьКолонку("ШтрихкодEAN");
//	МассивКодовSKU = Новый Массив;
//	СоответствиеВесовыхШтрихкодов = Новый Соответствие;
//	Для Каждого ШтрихкодEAN Из ШтрихкодыEAN Цикл 
//		ПрефиксВнутреннегоШтрихкодаВесовогоТовара = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ПрефиксВнутреннегоШтрихкодаВесовогоТовара");
//		ПрефиксВнутреннегоШтрихкодаШтучногоФасованногоТовара = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ПрефиксВнутреннегоШтрихкодаШтучногоФасованногоТовара");
//		ДлинаКодаВесовогоТовара = СтрДлина(Формат(ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВерхняяГраницаДиапазонаSKUВесовогоТовара"), "ЧГ = 0"));

//		ПрефиксКода = Лев(ШтрихкодEAN, 2);
//		ПрефиксВесовой = "2" + ПрефиксВнутреннегоШтрихкодаВесовогоТовара;
//		ПрефиксШтучный = "2" + ПрефиксВнутреннегоШтрихкодаШтучногоФасованногоТовара;
//		ЭтоВесовой = ПрефиксКода = ПрефиксВесовой И СтрДлина(ШтрихкодEAN) < 20; // EAN всегда короче, иначе это марка
//		ЭтоШтучный = ПрефиксКода = ПрефиксШтучный;

//		//вик 2023-04-28
//		ЭтоВесовой = ложь;//появились штучные штрихкоды с префиксом весового
//		//
//		
//		Если ДлинаКодаВесовогоТовара < 5 Тогда
//			ДлинаКодаВесовогоТовара = 5;
//		КонецЕсли;

//		КодТовара = ШтрихкодEAN;
//		Если ЭтоВесовой ИЛИ ЭтоШтучный Тогда
//			КодТовара = Число(Сред(ШтрихкодEAN, 3,  ДлинаКодаВесовогоТовара));
//			МассивКодовSKU.Добавить(КодТовара);
//		КонецЕсли;

//		СоответствиеВесовыхШтрихкодов.Вставить(КодТовара, ШтрихкодEAN);
//	КонецЦикла;

//	ТекстЗапроса = 
//	"ВЫБРАТЬ DISTINCT
//	|	0 КАК Порядок,
//	|	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура) КАК Номенклатура,
//	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Владелец) КАК ПредставлениеНоменклатуры,
//	
//	//|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
//	|	Характеристики.Ссылка КАК Характеристика,
//	
//	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка) КАК Серия,
//	|	ШтрихкодыНоменклатуры.Штрихкод КАК ШтрихкодEAN,
//	|	ВЫБОР
//	|		КОГДА ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).АлкогольнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)
//	|		КОГДА ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ТабачнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Табачная)
//	|		КОГДА ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ОбувнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Обувная)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
//	|	КОНЕЦ КАК ВидПродукции,
//	|	ЕСТЬNULL(ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
//	|		ИЛИ ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ТабачнаяПродукция
//	|		ИЛИ ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ОбувнаяПродукция КАК МаркируемаяПродукция
//	|ИЗ
//	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
//	|		ПО (ВидыНоменклатуры.Ссылка = ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ВидНоменклатуры)
//	|			И (ВидыНоменклатуры.ОсобенностьУчета В (ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция), ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция), ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Обувная)))
//	|	LEFT JOIN Справочник.ХарактеристикиНоменклатуры Характеристики ПО Характеристики.Владелец = ШтрихкодыНоменклатуры.Владелец И ШтрихкодыНоменклатуры.Владелец.ВидНоменклатуры.ИспользоватьХарактеристики
//	|ГДЕ
//	|	НЕ ШтрихкодыНоменклатуры.Владелец.ПометкаУдаления
//	|	И ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкоды)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ DISTINCT
//	|	1,
//	|	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура),
//	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Владелец),
//	
//	//|	ШтрихкодыНоменклатуры.Характеристика,
//	|	Характеристики.Ссылка КАК Характеристика,
//	
//	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка),
//	|	ШтрихкодыНоменклатуры.Штрихкод,
//	|	ВЫБОР
//	|		КОГДА ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).АлкогольнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)
//	|		КОГДА ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ТабачнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Табачная)
//	|		КОГДА ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ОбувнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Обувная)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	ЕСТЬNULL(ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
//	|		ИЛИ ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ТабачнаяПродукция
//	|		ИЛИ ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ОбувнаяПродукция
//	|ИЗ
//	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
//	|		ПО (ВидыНоменклатуры.Ссылка = ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.Номенклатура).ВидНоменклатуры)
//	|			И (НЕ ВидыНоменклатуры.ОсобенностьУчета В (ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.АлкогольнаяПродукция), ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ТабачнаяПродукция), ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Обувная)))
//	|	LEFT JOIN Справочник.ХарактеристикиНоменклатуры Характеристики ПО Характеристики.Владелец = ШтрихкодыНоменклатуры.Владелец И ШтрихкодыНоменклатуры.Владелец.ВидНоменклатуры.ИспользоватьХарактеристики
//	|ГДЕ
//	|	НЕ ШтрихкодыНоменклатуры.Владелец.ПометкаУдаления
//	|	И ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкоды)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	2,
//	|	КодыТоваровSKU.Номенклатура,
//	|	ПРЕДСТАВЛЕНИЕ(КодыТоваровSKU.Номенклатура),
//	|	КодыТоваровSKU.Характеристика,
//	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка),
//	|	КодыТоваровSKU.SKU,
//	|	ВЫБОР
//	|		КОГДА СпрНоменклатура.АлкогольнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)
//	|		КОГДА СпрНоменклатура.ТабачнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Табачная)
//	|		КОГДА СпрНоменклатура.ОбувнаяПродукция
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Обувная)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
//	|	КОНЕЦ,
//	|	ЕСТЬNULL(СпрНоменклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
//	|		ИЛИ СпрНоменклатура.ТабачнаяПродукция
//	|		ИЛИ СпрНоменклатура.ОбувнаяПродукция
//	|ИЗ
//	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
//	|		ПО КодыТоваровSKU.Номенклатура = СпрНоменклатура.Ссылка
//	|ГДЕ
//	|	КодыТоваровSKU.SKU В(&МассивКодовSKU)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	3,
//	|	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.ИнформационныеКарты),
//	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Владелец),
//	|	ШтрихкодыНоменклатуры.Характеристика,
//	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка),
//	|	ШтрихкодыНоменклатуры.Штрихкод,
//	|	ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка),
//	|	ЛОЖЬ
//	|ИЗ
//	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
//	|ГДЕ
//	|	НЕ ШтрихкодыНоменклатуры.Владелец.ПометкаУдаления
//	|	И ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкоды)
//	|	И ТИПЗНАЧЕНИЯ(ШтрихкодыНоменклатуры.Владелец) = ТИП(Справочник.ИнформационныеКарты)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	4,
//	|	ВЫРАЗИТЬ(ШтрихкодыНоменклатуры.Владелец КАК Справочник.СерийныеНомера),
//	|	ПРЕДСТАВЛЕНИЕ(ШтрихкодыНоменклатуры.Владелец),
//	|	ШтрихкодыНоменклатуры.Характеристика,
//	|	Значение(Справочник.СерииНоменклатуры.ПустаяСсылка),
//	|	ШтрихкодыНоменклатуры.Штрихкод,
//	|	ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка),
//	|	ЛОЖЬ
//	|ИЗ
//	|	РегистрСведений.Штрихкоды КАК ШтрихкодыНоменклатуры
//	|ГДЕ
//	|	НЕ ШтрихкодыНоменклатуры.Владелец.ПометкаУдаления
//	|	И ШтрихкодыНоменклатуры.Штрихкод В(&Штрихкоды)
//	|	И ТИПЗНАЧЕНИЯ(ШтрихкодыНоменклатуры.Владелец) = ТИП(Справочник.СерийныеНомера)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Порядок";

//	Запрос = Новый Запрос(ТекстЗапроса);

//	Запрос.УстановитьПараметр("Штрихкоды",      ШтрихкодыEAN);
//	Запрос.УстановитьПараметр("МассивКодовSKU", МассивКодовSKU);

//	ДанныеПоШтрихкодам = Запрос.Выполнить().Выгрузить();
//	Для Каждого ДанныеПоШтрихкоду Из ДанныеПоШтрихкодам Цикл 
//		ДанныеПоШтрихкоду.ШтрихкодEAN = СоответствиеВесовыхШтрихкодов.Получить(ДанныеПоШтрихкоду.ШтрихкодEAN);
//	КонецЦикла;

//	ДанныеПоШтрихкодамEAN = ДанныеПоШтрихкодам;

//КонецПроцедуры
